spec/pmacs_refile/test_app/app/controllers/multiple_posts_controller.rb

INSERT INTO "posts" ("title") VALUES (?)  [["title", "A cool post"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save