spec/pmacs_refile/test_app/app/controllers/presigned_posts_controller.rb

INSERT INTO "documents" ("post_id", "file_id", "file_filename", "file_content_type", "file_size") VALUES (?, ?, ?, ?, ?)  [["post_id", 23], ["file_id", "6651033a9306689592815bc1c82d941830b0df7ece097fa2fb644ee216e3"], ["file_filename", "hello.txt"], ["file_content_type", "text/plain"], ["file_size", 6]]
INSERT INTO "posts" ("title", "document_id", "document_filename", "document_content_type", "document_size") VALUES (?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(params.require(:post).permit(:title, :document, documents_files: []))

    if @post.save