spec/pmacs_refile/test_app/app/views/normal_posts/show.html.erb

<ul>
  <% @post.documents.each do |document| %>
---
SELECT "documents".* FROM "documents" WHERE "documents"."post_id" = ?  [["post_id", 15]]